function  [s_idx, seg]    =  Proc_cls_idx( cls_idx )
%cls_idx =43172*1是每个图像块所对应的聚类质心
[idx  s_idx]    =  sort(cls_idx);
%将cls_idx按照升序排列，idx是索引号，
%即把1号质心所对应的图像块排在最前面，70号质心所对应的图像块排在最后面
%s_idx是每个质心所对应的图像块编号，即1号质心所对应的图像块按照图像块编号顺序从小到大排列
idx2   =  idx(1:end-1) - idx(2:end);%43171*1
seq    =  find(idx2);%69*1
%返回idx2中非零元素所在位置
%这些非零元素都是每个聚类里面质心的第一个元素所对应的位置
%即seq=280，1738，2276，2471....
%其中:
%s_idx(1)=745,--->cls_idx(745)=1
%s_idx(280)=42917,--->cls_idx(42917)=1
%s_idx(281)=530,--->cls_idx(530)=2
%s_idx(1738)=43166,--->cls_idx(43166)=2
%s_idx(1739)=245,--->cls_idx(245)=3
%.............
seg    =  [0; seq; length(cls_idx)];%71*1